{
  "_name_or_path": "OpenGVLab/internimage_xl_22k_384",
  "act_layer": "GELU",
  "architectures": [
    "InternImageModel"
  ],
  "auto_map": {
    "AutoConfig": "configuration_internimage.InternImageConfig",
    "AutoModel": "modeling_internimage.InternImageModel",
    "AutoModelForImageClassification": "modeling_internimage.InternImageModelForImageClassification"
  },
  "center_feature_scale": false,
  "channels": 192,
  "cls_scale": 1.5,
  "core_op": "DCNv3",
  "depths": [
    5,
    5,
    24,
    5
  ],
  "drop_path_rate": 0.0,
  "drop_path_type": "linear",
  "drop_rate": 0.0,
  "dw_kernel_size": null,
  "groups": [
    12,
    24,
    48,
    96
  ],
  "layer_scale": 1e-05,
  "level2_post_norm": false,
  "level2_post_norm_block_ids": null,
  "mlp_ratio": 4.0,
  "model_type": "internimage",
  "norm_layer": "LN",
  "num_classes": 21841,
  "offset_scale": 2.0,
  "post_norm": true,
  "remove_center": false,
  "res_post_norm": false,
  "torch_dtype": "float32",
  "transformers_version": "4.37.2",
  "use_clip_projector": false,
  "with_cp": false
}
